def selectLogCode():
    thisis = '''
    ===========================天天购物超市系统================================
    请输入你的用户编码：
    1、以管理员身份登录系统
    2、以普通用户身份登录系统
    其他输入无效
    ========================================================================
    '''
    print(thisis)
    login_code = input("请输入用户编码：>")
    if login_code ==1:
        '''
        管理员逻辑
        '''
        pass
    elif login_code ==2:
        '''
        普通用户逻辑
        '''
        pass
    else:
        print('你输入有误')
    

if __name__ == '__main__':
    selectLogCode()